Repository: pqchecker/pqchecker
Catalog: po/*/pqchecker.po
Languages: fr

source: Bind error %s
fr: Erreur de connexion

source: Broadcast data error: %d
fr: Erreur de diffusion de données

source: Broadcast data, javaVM: %p
fr: Diffusion de données, javaJVM: %p

source: Broadcast fail.
fr: La diffusion a échoué

source: Broadcasting cached data..
fr: Diffusion des données en cache..

source: Caching data..
fr: Mise en cache des données..

source: Can't broadcast, data cached locally
fr: Impossible de diffuser, données mises en cache

source: Can't open parameters file storage: %s, %s.
fr: Impossible d'ouvrir le fichier de stockage des paramètres: %s, %s.

source: Can't open parameters storage file: %s, %s.
fr: Impossible d'ouvrir le fichier de stockage des paramètres: %s, %s.

source: Can't read parameters from file.
fr: Impossible de lire les paramètres à partir du fichier.

source: Cannot find class
fr: Impossible de trouver la classe

source: Cannot find method
fr: Impossible de trouver la méthode

source: Cannot make SHM region, error: %d
fr: Impossible de créer la zone de mémoire partagée

source: Cannot send/cache modified password, missing pqMessenger middleware
fr: Impossible d'envoyer/mettre en cache le mot de passe modifié, le middleware pqMessenger est absent

source: Checking password quality for %s.
fr: Vérification du mot de passe pour %s.

source: Communication with pqMessenger established
fr: La communication avec pqMessenger est établie

source: Connection error %d
fr: Erreur de connexion %d

source: Done
fr: Fait

source: Error: %d
fr: Erreur: %d

source: Listen stopped
fr: Ecoute arrêtée

source: Listening..
fr: Ecoute..

source: Modified password successfully sent..
fr: Succès de l'envoi du mot de passe modifié

source: No data found in parameters file storage: %s.
fr: Pas de données dans le fichier de stockage des paramètres: %s.

source: OnLoad called, javaVM: %p
fr: Appel de OnLOad, javaJVM: %p

source: OnUnLoad called, javaVM: %p
fr: Appel de OnLoad, javaJVM: %p

source: Open shared memory region: %d
fr: Zone de mémoire partagée ouverte: %d

source: Parameters container or format string not found.
fr: Le conteneur des paramètres ou le format introuvable.

source: Parameters data or format string not found.
fr: Les données des paramètres ou le format introuvables.

source: Partial data write
fr: Ecriture partielle de données

source: Password accepted.
fr: Le mot de passe est accepté.

source: Password rejected.
fr: Le mot de passe est rejeté.

source: SHM region map failed, error: %d
fr: Echec du lien avec la zone de mémoire partagée: %d

source: SHM region open failed, error: %d
fr: Echec de l'ouverture de la zone de mémoire partagée: %d

source: SHM region unmap failed, error: %d
fr: Echec de la rupture du lien avec la zone de mémoire partagée: %d

source: SHM truncate error: %d
fr: Erreur d'effacement de la mémoire partagée

source: Sending data..
fr: Envoi des données..

source: Sending modified password
fr: Envoi du mot de passe modifié

source: Sending password to pqMessenger
fr: Envoi du mot de passe vers pqMessenger

source: Set cache data to %d
fr: Affectation des données de cache à %d

source: Socket error %d
fr: Erreur de socket %d

source: Socket listen error %d
fr: Erreur d'écoute de socket %d

source: Start listen request
fr: Demande de démarrage d'écoute

source: Stop listen request
fr: Demande d'arrêt d'écoute

source: The format [%s] does not operable.
fr: Le format [%s] n'est pas utilisable.

source: The format string [%s] supplied isn't operable.
fr: Le format [%s] fourni n'est pas utilisable.

source: The parameter [%s] does not operable.
fr: Le paramètre [%s] n'est pas utilisable.

source: The password does not pass quality check.
fr: Le mot de passe ne passe pas le contrôle de qualité.

source: The passwords quality parameter is not found.
fr: Paramètre de la qualité des mots de passe non trouvé.

source: The passwords quality parameter is not operable.
fr: Le paramètre de la qualité des mots de passe n'est pas utilisable.

source: Unable to verify the quality of the password. Problem in parameters.
fr: Impossible de vérifier la qualité du mot de passe. Problème de paramétrage.

source: Version error: %d
fr: Erreur de version

source: Write error
fr: Erreur d'écriture

source: shmPush: shared memory full
fr: shmPush: Mémoire partagée pleine
